Repository: ChhunVirak/aklo-cafe
Catalog: lib/l10n/intl_*.arb
Languages: kk

source: Languages
kk: ភាសា

# languagesDes
source: Choose Preference Languages
kk: រើសភាសា

source: Email
kk: អ៊ីម៉ែល

# emailValidateMessage
source: Email is required.
kk: សូមបញ្ចូលអ៊ីម៉ែល

source: Password
kk: លេខសំងាត់

# passwordValidateMessage
source: Password is required.
kk: សូមបញ្ចូលលេខសំងាត់

# userNameValidateMessage
source: Username is required.
kk: សូមបញ្ចូលឈ្មោះអ្នកចូលប្រើ

source: Login
kk: ចូល

source: Orders
kk: ការកម្ម៉ង់ទាំងអស់

source: Histories
kk: ប្រវត្តិ

source: Inventory
kk: ស្តុក

source: Users
kk: អ្នកប្រើប្រាស់

# allCoffeeTitle
source: All Drinks
kk: ភេសជ្ជៈទាំងអស់

source: Add Drink
kk: បន្ថែមភេសជ្ជៈ

source: Add Category
kk: បន្ថែមប្រភេទភេសជ្ជៈ

# category
source: All Categories
kk: ប្រភេទទាំងអស់

source: Dashboard
kk: ផ្ទាំងគ្រប់គ្រង

source: Setting
kk: ការកំណត់

source: Sign Out
kk: ចាកចេញ

# scan
source: Scan to E-Menu
kk: ស្គែនទៅកាន់ មីនុយអេឡិចត្រូនិច

source: Drink Name
kk: ឈ្មោះភេសជ្ជៈ

# categoryName
source: Category
kk: ប្រភេទភេសជ្ជៈ

source: Unit Price
kk: តម្លៃឯកតាភេសជ្ជៈ

# amount
source: Amounts
kk: បរិមាណភេសជ្ជៈ

source: Add
kk: បន្ថែម

source: Update
kk: កែប្រែ

# drinkNameValidateMessage
source: Field drink name can't be empty.
kk: ឈ្មោះភេសជ្ជៈមិនអាចទទេបានទេ

# drinkCategoryValidateMessage
source: Field drink category can't be empty.
kk: ប្រភេទភេសជ្ជៈមិនអាចទទេបានទេ

# drinkUnitPriceValidateMessage
source: Field drink unit price can't be empty.
kk: តម្លៃឯកតាភេសជ្ជៈមិនអាចទទេបានទេ

# drinkUnitPriceValidateMessagesmallthanzero
source: Drink price can't be 0$.
kk: តម្លៃឯកតាភេសជ្ជៈមិនអាច 0$ បានទេ.

# drinkUnitPriceValidateMessagemax
source: Drink price can't be more than 20$.
kk: តម្លៃឯកតាភេសជ្ជៈមិនអាចខ្ពស់ជាង 20$ បានទេ.

# drinkTotalAmountValidateMessage
source: Field drink amount can't be empty.
kk: បរិមាណភេសជ្ជៈមិនអាចទទេបានទេ

# categoryNameAmountValidateMessage
source: Field category name can't be empty.
kk: ឈ្មោះប្រភេទមិនអាចទទេបានទេ

# category_name_en
source: Category English Name
kk: ឈ្មោះប្រភេទភេសជ្ជៈជាភាសាអង់គ្លេស

# category_name_kh
source: Category Khmer Name
kk: ឈ្មោះប្រភេទភេសជ្ជៈជាភាសាខ្មែរ

# category_desc
source: Description
kk: ពិពណ៌នា

# category_name_en_ValidateMessage
source: Field Category English Name can't be empty.
kk: ឈ្មោះប្រភេទភេសជ្ជៈជាភាសាអង់គ្លេសមិនអាចទទេបានទេ

# category_name_kh_ValidateMessage
source: Field Category Khmer Name can't be empty.
kk: ឈ្មោះប្រភេទភេសជ្ជៈជាភាសាខ្មែរមិនអាចទទេបានទេ

source: All
kk: ទាំងអស់

source: Success
kk: ជោគជ័យ

# delete_success
source: Delete Successfully
kk: លុបបានជោគជ័យ

# add_success
source: Add Successfully
kk: ការបន្ថែមបានជោគជ័យ

source: Make Order
kk: ធ្វើការកម្មង់

source: No Data
kk: គ្មានទិន្ន័យ

source: Image
kk: រូបភាព

source: No Image
kk: គ្មានរូបភាព

source: Gallery
kk: រូបភាព

source: Camera
kk: កាមេរ៉ា

source: Available
kk: មាន

source: Unavailable
kk: មិនមាន

# newOrder
source: New
kk: កម្មង់ថ្មី

source: Accepted
kk: បានទទួល

source: Accept
kk: ទទួល

source: Cancelled
kk: បានបោះបង់

source: Warning
kk: សូមបញ្ជាក់

# warning_delete
source: Do you want to delete this Drink?
kk: តើអ្នកចង់លុបភេសជ្ជៈនេះមែនទេ?

source: Yes
kk: យល់ព្រម

source: Cancel
kk: បោះបង់

# add_drink_message
source: Please add drink
kk: សូមជ្រើសភេសជ្ជៈ

# add_drink_message_des
source: a drink is required to make order
kk: សូមរើសយ៉ាងហោចណាស់មួយដើម្បីកម្មង់

source: Done
kk: រួចរាល់

source: Total
kk: សរុប

source: Check Out
kk: ពិនិត្យ​

source: Today Total Order
kk: ការកម្មង់សរុបថ្ងៃនេះ

source: Edit
kk: កែប្រែ

source: Delete
kk: លុប

source: New Order
kk: កម្មង់ថ្មី

# sugar
source: Sugar Level
kk: កម្រឹតស្ករ

# drink_done
source: Drink Done, please go to get your Drinks!
kk: ភេសជ្ជៈទាំងអស់បានធ្វើរួចរាល់ លោកអ្នកអាចមកយកបាន

source: About us
kk: អំពីពួកយើង

# add_profile
source: Add Member
kk: បន្ថែមសមាជិក

source: Fail
kk: បរាជ័យ

# edit_slide
source: Edit Slides
kk: កែប្រែស្លាយ

source: Link
kk: តំណភ្ជាប់

source: Confirm
kk: សូមបញ្ជាក់

# delete_img_message
source: Are you sure want to delete this image?
kk: តើអ្នកចង់លុបរូបភាពនេះមែនទេ?

# logout_message
source: Are you sure want to sign out?
kk: តើអ្នកចង់ចាកចេញពីគណនេយ្យនេះមែនទេ?

# save_img_msg
source: Invoice saved to Gallery.
kk: វិក័យប័ត្របានរក្សាទុកក្នុងរុបភាព

source: Data
kk: ទិន្នន័យ
